In [250]:
# instalando a biblioteca pandas
!pip install pandas

Requirement already satisfied: pandas in c:\users\muril\appdata\local\programs\python\python313\lib\site-packages (2.3.1)
Requirement already satisfied: numpy>=1.26.0 in c:\users\muril\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.3.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\muril\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\muril\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\muril\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\muril\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [251]:
# Importando a Biblioteca Pandas
import pandas as pd

In [252]:
# Criando um dicionario
Dicionario = {
    'A':[1,2,3],
    'B':[-3,-2,-1],
    'C':[0,10,20]
}
Label = ['1ª Linha', '2ª Linha', '3ª Linha']
Dataframe_01 = pd.DataFrame(Dicionario,index=Label)
print(Dataframe_01)

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [253]:
# Exibindo as colunas A e B
Dataframe_01[['A', 'B']]

          A  B
1ª Linha  1 -3
2ª Linha  2 -2
3ª Linha  3 -1

In [254]:
# Criando uma coluna nova no Dataframe
Dataframe_01['Nova Coluna'] = Dataframe_01['A'] *Dataframe_01['B']

In [255]:
Dataframe_01 # Exibe o dataframe

          A  B   C  Nova Coluna
1ª Linha  1 -3   0           -3
2ª Linha  2 -2  10           -4
3ª Linha  3 -1  20           -3

In [256]:
# Exibindo valores na saida da celula do notebook
a = 6
print(a)
Dataframe_01

6

          A  B   C  Nova Coluna
1ª Linha  1 -3   0           -3
2ª Linha  2 -2  10           -4
3ª Linha  3 -1  20           -3

In [257]:
# Excluindo uma coluna do dataframe
# Drop exclui uma linha ou coluna do dataframe
Dataframe_01.drop('Nova Coluna',axis =1) # Exclui a nova coluna do Dataframe 1

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [258]:
# Excluindo uma coluna definitivamente do Dataframe
Dataframe_01.drop('Nova Coluna',axis =1,inplace=True)

In [259]:
# Localizando uma linha do Dataframe utilizando o comando Loc
Dataframe_01.loc['1ª Linha']

A    1
B   -3
C    0
Name: 1ª Linha, dtype: int64

In [260]:
Dataframe_01.loc['2ª Linha']

A     2
B    -2
C    10
Name: 2ª Linha, dtype: int64

In [261]:
Dataframe_01.loc['3ª Linha']

A     3
B    -1
C    20
Name: 3ª Linha, dtype: int64

In [262]:
# Localizando Diversas linhas e colunas
Dataframe_01.loc[['1ª Linha', '2ª Linha'],['A', 'C']] # Nome da linha e nome da coluna

          A   C
1ª Linha  1   0
2ª Linha  2  10

In [263]:
# Localizando a linha e a coluna ppelo indice
Dataframe_01.iloc[2:3,1:] # Linha, Coluna

          B   C
3ª Linha -1  20

In [264]:
Dataframe_01.iloc[2:3,1:] # Linha, Coluna

          B   C
3ª Linha -1  20

In [265]:
# Verificando as condiçoes no Dataframe
print(Dataframe_01)
Dataframe_01 >0

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

             A      B      C
1ª Linha  True  False  False
2ª Linha  True  False   True
3ª Linha  True  False   True

In [266]:
# Criando filtro no Dataframe
Filtro = Dataframe_01['C'] >0 # Armazena em filtro a resposta da verificação
Dataframe_02 = Dataframe_01[Filtro] # Cria um novo Dataframe
Dataframe_02['A']

2ª Linha    2
3ª Linha    3
Name: A, dtype: int64

In [267]:
Filtro

1ª Linha    False
2ª Linha     True
3ª Linha     True
Name: C, dtype: bool

In [268]:
# Cria um filtro utilizando a condição &
Dataframe_01[(Dataframe_01['B']>5) | (Dataframe_01['C']>2)]

          A  B   C
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [269]:
Dataframe_01

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [270]:
# Resetando o index do Dataframe
Dataframe_01.reset_index()

      index  A  B   C
0  1ª Linha  1 -3   0
1  2ª Linha  2 -2  10
2  3ª Linha  3 -1  20

In [271]:
Dataframe_01

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [272]:
Dataframe_01.reset_index(inplace=True)

In [273]:
Dataframe_01

      index  A  B   C
0  1ª Linha  1 -3   0
1  2ª Linha  2 -2  10
2  3ª Linha  3 -1  20

In [274]:
Dataframe_01.drop('index',axis=1, inplace=True) # Exclui coluna Index

In [275]:
Dataframe_01

   A  B   C
0  1 -3   0
1  2 -2  10
2  3 -1  20

In [276]:
# Criando varios dicionarios
Dicionario_01 = {
    'A':[1,2,3],
    'B':[-32,-21,-15],
    'C':[60,10,20],
    'Chave':['AA','BB','CC']
}

# Dicionario 2
Dicionario_02 = {
    'A':[6,7,8],
    'B':[-39,-28,-17],
    'C':[1000, 10, 60],
    'Chave':['AA','BB','CC']

}

# Dicionario 3
Dicionario_03 = {
    'A':[11,12,13],
    'B':[-39,-22,-11],
    'C':[30,10,20],
    'Chave':['AA','BB','CC']

}

# Criando as listas para serem os labels
Label_01 = ['1ª Linha', '2ª Linha', '3ª Linha']
Label_02 = ['4ª Linha', '5ª Linha', '6ª Linha']
Label_03 = ['7ª Linha', '8ª Linha', '9ª Linha']

# Criando os dataframes

Dataframe_01n = pd.DataFrame(Dicionario_01,index= Label_01)
Dataframe_02n = pd.DataFrame(Dicionario_02, index= Label_02)
Dataframe_03 = pd.DataFrame(Dicionario_03, index= Label_03)

In [277]:
Dataframe_01 # Exibe o Dataframe 1

   A  B   C
0  1 -3   0
1  2 -2  10
2  3 -1  20

In [278]:
Dataframe_02

          A  B   C
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [279]:
Dataframe_03

           A   B   C Chave
7ª Linha  11 -39  30    AA
8ª Linha  12 -22  10    BB
9ª Linha  13 -11  20    CC

In [280]:
# Empilhando os Dataframes 1,2 e 3
pd.concat([Dataframe_01,Dataframe_02,Dataframe_03])

           A   B   C Chave
0          1  -3   0   NaN
1          2  -2  10   NaN
2          3  -1  20   NaN
2ª Linha   2  -2  10   NaN
3ª Linha   3  -1  20   NaN
7ª Linha  11 -39  30    AA
8ª Linha  12 -22  10    BB
9ª Linha  13 -11  20    CC

In [281]:
# Mescla os dataframes utilizando o merge how inner verifica se a chavwe esta presente em ambos os lados do dataframe
pd.merge(Dataframe_01n,Dataframe_02n,how='inner', on='Chave')

   A_x  B_x  C_x Chave  A_y  B_y   C_y
0    1  -32   60    AA    6  -39  1000
1    2  -21   10    BB    7  -28    10
2    3  -15   20    CC    8  -17    60

In [282]:
pd.merge(Dataframe_01n,Dataframe_02n,how='left', on='Chave')

   A_x  B_x  C_x Chave  A_y  B_y   C_y
0    1  -32   60    AA    6  -39  1000
1    2  -21   10    BB    7  -28    10
2    3  -15   20    CC    8  -17    60

In [283]:
pd.merge(Dataframe_01n,Dataframe_02n,how='right', on='Chave')

   A_x  B_x  C_x Chave  A_y  B_y   C_y
0    1  -32   60    AA    6  -39  1000
1    2  -21   10    BB    7  -28    10
2    3  -15   20    CC    8  -17    60

In [284]:
pd.merge(Dataframe_01n,Dataframe_02n,how='outer', on='Chave')

   A_x  B_x  C_x Chave  A_y  B_y   C_y
0    1  -32   60    AA    6  -39  1000
1    2  -21   10    BB    7  -28    10
2    3  -15   20    CC    8  -17    60